// Напишите программу, которая создает массив из введенных через запятую цифр
//void PrintArray(int[] col)
//{
    //int count = col.Length;
    //int position = 0;
    //while (position < count)
    //{
       // Console.Write($"{col[position]} ");
        //position++;
    //}
//}
Console.WriteLine("Введите число a");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число b");
int b =  Convert.ToInt32(Console.ReadLine());


Console.Write("{a,b}");